tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "wix/brew"
# Engine for large-scale data processing
brew "apache-spark"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Top-like interface for container metrics
brew "ctop"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Generic library support script
brew "libtool"
# Manage compile and link flags for libraries
brew "pkg-config"
# HTTP/2 C Library
brew "nghttp2"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# USB multiplexor library for iOS devices
brew "libusbmuxd"
# Library to communicate with iOS devices natively
brew "libimobiledevice", args: ["HEAD"]
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Sophisticated file transfer program
brew "lftp"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node", link: false
# Password manager
brew "pass"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# JVM-based programming language
brew "scala"
# Create beautiful image of your source code
brew "silicon"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# User interface to the TELNET protocol
brew "telnet"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Apple simulator utilities
brew "wix/brew/applesimutils"
# Apple TV Aerial screensaver
cask "aerial"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
cask "android-sdk"
cask "java"
cask "java8"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Open-source version of the X.Org X Window System
cask "xquartz"
